Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateRevealWarn Property
 Could not create Reveal. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateRevealWarn { get; }
Public Shared ReadOnly Property CannotCreateRevealWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateRevealWarn {
	FailureDefinitionId^ get ();
}
static member CannotCreateRevealWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace